In [1]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\miki_\anaconda3\lib\site-packages (3.0.5)
Requirement already satisfied: jdcal in c:\users\miki_\anaconda3\lib\site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in c:\users\miki_\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
q32017 = '../housingcsv/2017q3.xlsx'
df1 = pd.read_excel(q32017,engine='openpyxl')
refine1 = refine1 = df1.drop(['Sales\n3Q 2016', 'Median\n3Q 2016', 'Median\nChange'], axis=1)
refine1= refine1.rename(columns={'Sales\n3Q 2017': 'Sales Q3 2017', 'Median\nQ3 2017': 'Median Q3 2017'})
refine1

               City          Suburb  Sales Q3 2017  Median\n3Q 2017
0          ADELAIDE        ADELAIDE            4.0         695000.0
1          ADELAIDE  NORTH ADELAIDE            9.0        1375000.0
2    ADELAIDE HILLS         ALDGATE           12.0         735000.0
3    ADELAIDE HILLS          ASHTON            NaN              NaN
4    ADELAIDE HILLS    BASKET RANGE            1.0         488000.0
..              ...             ...            ...              ...
473    WEST TORRENS       THEBARTON            2.0         536250.0
474    WEST TORRENS    TORRENSVILLE            8.0         525000.0
475    WEST TORRENS       UNDERDALE            7.0         565000.0
476    WEST TORRENS      WEST BEACH           14.0         770000.0
477    WEST TORRENS   WEST RICHMOND            4.0         379500.0

[478 rows x 4 columns]

In [4]:
q42017 = "../housingcsv/2017q4.xlsx"
df2 = pd.read_excel(q42017,engine='openpyxl')
refine2 = df2.drop(['Sales\n4Q 2016', 'Median\n4Q 2016', 'Median\nChange'], axis=1)
refine2 = refine2.rename(columns={'Sales\n4Q 2017':'Sales Q4 2017', 'Median\n4Q 2017': 'Median Q4 2017'})
refine2

               City          Suburb  Sales Q4 2017  Median Q4 2017
0          ADELAIDE        ADELAIDE            6.0        780500.0
1          ADELAIDE  NORTH ADELAIDE            5.0       1095000.0
2    ADELAIDE HILLS         ALDGATE           10.0        675000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            6.0        588650.0
475    WEST TORRENS    TORRENSVILLE           10.0        635000.0
476    WEST TORRENS       UNDERDALE            8.0        650000.0
477    WEST TORRENS      WEST BEACH            8.0        712500.0
478    WEST TORRENS   WEST RICHMOND            2.0        495000.0

[479 rows x 4 columns]

In [5]:
q12018 = "../housingcsv/2018q1.xlsx"
df3 = pd.read_excel(q12018,engine='openpyxl')
refine3 = df3.drop(['Sales\n1Q 2017', 'Median\n1Q 2017', 'Median\nChange'], axis=1)
refine3 = refine3.rename(columns={'Sales\n1Q 2018':'Sales Q1 2018', 'Median\n1Q 2018': 'Median Q1 2018'})
refine3

               City          Suburb  Sales Q1 2018  Median Q1 2018
0          ADELAIDE        ADELAIDE            5.0        861000.0
1          ADELAIDE  NORTH ADELAIDE            2.0       2195500.0
2    ADELAIDE HILLS         ALDGATE           17.0        696000.0
3    ADELAIDE HILLS          ASHTON            3.0        681200.0
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            4.0        560000.0
475    WEST TORRENS    TORRENSVILLE           15.0        545000.0
476    WEST TORRENS       UNDERDALE            8.0        610500.0
477    WEST TORRENS      WEST BEACH           13.0        691250.0
478    WEST TORRENS   WEST RICHMOND            7.0        430000.0

[479 rows x 4 columns]

In [6]:
q22018 = '../housingcsv/2018q2.xlsx'
df4 = pd.read_excel(q22018,engine='openpyxl')
refine4 = df4.drop(['Sales\n2Q 2017', 'Median\n2Q 2017', 'Median\nChange'], axis=1)
refine4 = refine4.rename(columns={'Sales\n2Q 2018': 'Sales Q2 2018', 'Median\n2Q 2018': 'Median Q2 2018'})
refine4

               City          Suburb  Sales Q2 2018  Median Q2 2018
0          ADELAIDE        ADELAIDE            5.0        696000.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1510000.0
2    ADELAIDE HILLS         ALDGATE           15.0        820000.0
3    ADELAIDE HILLS          ASHTON            1.0        505000.0
4    ADELAIDE HILLS    BASKET RANGE            1.0        532500.0
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            3.0        510000.0
475    WEST TORRENS    TORRENSVILLE           10.0        552500.0
476    WEST TORRENS       UNDERDALE            8.0        627500.0
477    WEST TORRENS      WEST BEACH           12.0        706250.0
478    WEST TORRENS   WEST RICHMOND            2.0        450500.0

[479 rows x 4 columns]

In [7]:
merged1 = pd.merge(refine1,refine2)
merged2 = pd.merge(refine3,refine4)
final = pd.merge(merged1,merged2)
final = final.dropna(how='any')
final

,City,Suburb,Sales Q3 2017,Median\n3Q 2017,Sales Q4 2017,Median Q4 2017,Sales Q1 2018,Median Q1 2018,Sales Q2 2018,Median Q2 2018
0,ADELAIDE,ADELAIDE,4.0,695000.0,6.0,780500.0,5.0,861000.0,5.0,696000.0
1,ADELAIDE,NORTH ADELAIDE,9.0,1375000.0,5.0,1095000.0,2.0,2195500.0,6.0,1510000.0
2,ADELAIDE HILLS,ALDGATE,12.0,735000.0,10.0,675000.0,17.0,696000.0,15.0,820000.0
5,ADELAIDE HILLS,BELAIR,21.0,613000.0,14.0,570000.0,14.0,585000.0,14.0,577500.0
7,ADELAIDE HILLS,BRIDGEWATER,24.0,465000.0,18.0,448000.0,18.0,490000.0,19.0,535000.0
...,...,...,...,...,...,...,...,...,...,...
473,WEST TORRENS,THEBARTON,2.0,536250.0,6.0,588650.0,4.0,560000.0,3.0,510000.0
474,WEST TORRENS,TORRENSVILLE,8.0,525000.0,10.0,635000.0,15.0,545000.0,10.0,552500.0
475,WEST TORRENS,UNDERDALE,7.0,565000.0,8.0,650000.0,8.0,610500.0,8.0,627500.0
476,WEST TORRENS,WEST BEACH,14.0,770000.0,8.0,712500.0,13.0,691250.0,12.0,706250.0
477,WEST TORRENS,WEST RICHMOND,4.0,379500.0,2.0,495000.0,7.0,430000.0,2.0,450500.0

In [11]:
#Create column for value of propety prices by suburb for finanical year
new_col=[""]
final["y17_18_price"]=(final["Median\n3Q 2017"]+final["Median Q4 2017"]+final["Median Q1 2018"]+final["Median Q2 2018"])/4
final
y17_18_price=final
y17_18_price

#add new column to hold total sales for whole year
new_col=[""]
final["sales_17_18"]=(final["Sales Q3 2017"]+final["Sales Q4 2017"]+final["Sales Q1 2018"]+final["Sales Q2 2018"])
y19_20_price=final
y19_20_price

,City,Suburb,Sales Q3 2017,Median\n3Q 2017,Sales Q4 2017,Median Q4 2017,Sales Q1 2018,Median Q1 2018,Sales Q2 2018,Median Q2 2018,y17_18_price,sales_17_18
0,ADELAIDE,ADELAIDE,4.0,695000.0,6.0,780500.0,5.0,861000.0,5.0,696000.0,758125.0,20.0
1,ADELAIDE,NORTH ADELAIDE,9.0,1375000.0,5.0,1095000.0,2.0,2195500.0,6.0,1510000.0,1543875.0,22.0
2,ADELAIDE HILLS,ALDGATE,12.0,735000.0,10.0,675000.0,17.0,696000.0,15.0,820000.0,731500.0,54.0
5,ADELAIDE HILLS,BELAIR,21.0,613000.0,14.0,570000.0,14.0,585000.0,14.0,577500.0,586375.0,63.0
7,ADELAIDE HILLS,BRIDGEWATER,24.0,465000.0,18.0,448000.0,18.0,490000.0,19.0,535000.0,484500.0,79.0
...,...,...,...,...,...,...,...,...,...,...,...,...
473,WEST TORRENS,THEBARTON,2.0,536250.0,6.0,588650.0,4.0,560000.0,3.0,510000.0,548725.0,15.0
474,WEST TORRENS,TORRENSVILLE,8.0,525000.0,10.0,635000.0,15.0,545000.0,10.0,552500.0,564375.0,43.0
475,WEST TORRENS,UNDERDALE,7.0,565000.0,8.0,650000.0,8.0,610500.0,8.0,627500.0,613250.0,31.0
476,WEST TORRENS,WEST BEACH,14.0,770000.0,8.0,712500.0,13.0,691250.0,12.0,706250.0,720000.0,47.0
477,WEST TORRENS,WEST RICHMOND,4.0,379500.0,2.0,495000.0,7.0,430000.0,2.0,450500.0,438750.0,15.0

In [9]:
final.to_csv("y17_18_house.csv")

In [10]:
%store y17_18_price

Stored 'y17_18_price' (DataFrame)

In [12]:
# set up a new datafram to hold just suburb, sales count and median price for scatter plot
refined_Y1718=pd.DataFrame([y17_18_price.Suburb,y17_18_price.y17_18_price,y17_18_price.sales_17_18]).transpose()
refined_Y1718

             Suburb y17_18_price sales_17_18
0          ADELAIDE       758125          20
1    NORTH ADELAIDE  1.54388e+06          22
2           ALDGATE       731500          54
5            BELAIR       586375          63
7       BRIDGEWATER       484500          79
..              ...          ...         ...
473       THEBARTON       548725          15
474    TORRENSVILLE       564375          43
475       UNDERDALE       613250          31
476      WEST BEACH       720000          47
477   WEST RICHMOND       438750          15

[367 rows x 3 columns]

In [13]:
# sort by median price and retrieve just 10
bottom_10_price=refined_Y1718.sort_values(by=['y17_18_price'],ascending=True)
bottom_10_price=bottom_10_price.head(10)

# format price
bottom_10_price["y17_18_price"]=bottom_10_price["y17_18_price"].map("{:,}".format)

print(f"Bottom 10 ranking in median price Suburbs\n{bottom_10_price}\n")

Bottom 10 ranking in median price Suburbs
                Suburb y17_18_price sales_17_18
305  SMITHFIELD PLAINS    189,500.0          40
287    ELIZABETH NORTH    192,687.5          32
280       DAVOREN PARK    196,437.5          93
284    ELIZABETH DOWNS    200,125.0          83
288     ELIZABETH PARK    217,250.0          75
286    ELIZABETH GROVE    218,312.5          24
285     ELIZABETH EAST    221,125.0          47
289    ELIZABETH SOUTH    230,562.5          21
381     ELIZABETH VALE    242,250.0          52
290     ELIZABETH VALE    242,250.0          52

In [14]:
# sort by median price and retrieve just 10
top_10_price=refined_Y1718.sort_values(by=['y17_18_price'],ascending=False)
top_10_price=top_10_price.head(10)

# format price
top_10_price["y17_18_price"]=top_10_price["y17_18_price"].map("{:,}".format)

print(f"Top 10 ranking in median price Suburbs\n{top_10_price}\n")

Top 10 ranking in median price Suburbs
             Suburb  y17_18_price sales_17_18
449        MEDINDIE   2,425,812.5          10
446      UNLEY PARK  2,085,466.75          28
451     WALKERVILLE   1,552,875.0          18
1    NORTH ADELAIDE   1,543,875.0          22
62   TOORAK GARDENS   1,459,312.5          31
448       GILBERTON   1,456,625.0          13
57        ROSE PARK   1,456,375.0           7
438       HYDE PARK   1,449,625.0          24
63          TUSMORE   1,441,977.5          17
41          DULWICH   1,391,000.0          19